{
    "label_type": "character",
    "blank_token": "<blank>",
    "unknown_token": "<unk>",
    "blank_id": 0,
    "unknown_id": 1,
    "vocab_size": 61,
    "char_to_id": {
        "<blank>": 0,
        "<unk>": 1,
        " ": 2,
        "%": 3,
        ".": 4,
        "0": 5,
        "1": 6,
        "6": 7,
        "9": 8,
        "A": 9,
        "I": 10,
        "P": 11,
        "a": 12,
        "c": 13,
        "d": 14,
        "e": 15,
        "f": 16,
        "i": 17,
        "k": 18,
        "l": 19,
        "m": 20,
        "n": 21,
        "o": 22,
        "p": 23,
        "r": 24,
        "s": 25,
        "t": 26,
        "u": 27,
        "y": 28,
        "،": 29,
        "ء": 30,
        "ا": 31,
        "ب": 32,
        "ة": 33,
        "ت": 34,
        "ث": 35,
        "ج": 36,
        "ح": 37,
        "خ": 38,
        "د": 39,
        "ذ": 40,
        "ر": 41,
        "ز": 42,
        "س": 43,
        "ش": 44,
        "ص": 45,
        "ض": 46,
        "ط": 47,
        "ظ": 48,
        "ع": 49,
        "غ": 50,
        "ف": 51,
        "ق": 52,
        "ك": 53,
        "ل": 54,
        "م": 55,
        "ن": 56,
        "ه": 57,
        "و": 58,
        "ي": 59,
        "어": 60
    },
    "id_to_char": {
        "0": "<blank>",
        "1": "<unk>",
        "2": " ",
        "3": "%",
        "4": ".",
        "5": "0",
        "6": "1",
        "7": "6",
        "8": "9",
        "9": "A",
        "10": "I",
        "11": "P",
        "12": "a",
        "13": "c",
        "14": "d",
        "15": "e",
        "16": "f",
        "17": "i",
        "18": "k",
        "19": "l",
        "20": "m",
        "21": "n",
        "22": "o",
        "23": "p",
        "24": "r",
        "25": "s",
        "26": "t",
        "27": "u",
        "28": "y",
        "29": "،",
        "30": "ء",
        "31": "ا",
        "32": "ب",
        "33": "ة",
        "34": "ت",
        "35": "ث",
        "36": "ج",
        "37": "ح",
        "38": "خ",
        "39": "د",
        "40": "ذ",
        "41": "ر",
        "42": "ز",
        "43": "س",
        "44": "ش",
        "45": "ص",
        "46": "ض",
        "47": "ط",
        "48": "ظ",
        "49": "ع",
        "50": "غ",
        "51": "ف",
        "52": "ق",
        "53": "ك",
        "54": "ل",
        "55": "م",
        "56": "ن",
        "57": "ه",
        "58": "و",
        "59": "ي",
        "60": "어"
    }
}